Terraform plan for __dev__
<details>
  <summary>Plan: 2 to add, 1 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # kubernetes_limit_range.cluster_limit["ebo"] will be created
  + resource "kubernetes_limit_range" "cluster_limit" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "default-limit"
          + namespace        = "ebo"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + limit {
              + default         = {
                  + "memory" = "800m"
                }
              + default_request = {
                  + "cpu"    = "500m"
                  + "memory" = "800m"
                }
              + type            = "Container"
            }
        }
    }

  # kubernetes_limit_range.cluster_limit["inventory"] will be updated in-place
  ~ resource "kubernetes_limit_range" "cluster_limit" {
        id = "inventory/default-limit"


      ~ spec {
          ~ limit {
              ~ default                 = {
                  ~ "memory" = "1G" -> "800m"
                }
              ~ default_request         = {
                  ~ "memory" = "1G" -> "800m"
                    # (1 unchanged element hidden)
                }
                # (4 unchanged attributes hidden)
            }
        }
        # (1 unchanged block hidden)
    }

  # kubernetes_namespace.gke_namespace["ebo"] will be created
  + resource "kubernetes_namespace" "gke_namespace" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "ebo"
            }
          + generation       = (known after apply)
          + labels           = {
              + "istio-injection" = "enabled"
              + "project"         = "ebo-dev"
            }
          + name             = "ebo"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 4, in module "jumpbox":
   4:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

Plan generated in [Terraform #127](https://github.com/ebomart/commerce-infrastructure/actions/runs/1211975775)